[{"commands_raw":"signal(set_bool,spoke_before,true)\nAlright. Welcome to your workstation.\n---\nLucky lucky, the last guy left some stuff for you.\n---\nI'm sure it'll feel like home in no time.\n---\nUnless you know what you're doing, I wouldn't touch anything.\n---\nGet a little closer and I'll give you the details.\n","gnode_name":"intro","id":0,"name":"intro","position":[840,520]},{"commands_raw":"$if monster_spawned{\n->ohno\n}\n$if spoke_before {\n-> rundown\n}\n$else {\n-> intro\n}","gnode_name":"start","id":1,"name":"start","position":[480,540]},{"commands_raw":"Alright, lets see here...I've got some literature I'm legally obligated to give you...\n---\n\"Welcome to the Agency, formerly Sterns' Travel and Vacations.\"\n---\n\"We are delighted to have you as the newest member of our Screening Team!\"\n---\n\"Your being here is either a testament to your dedication to quality service, or is a result of a government-mandated private employment raffle.\nEither way, you are now part of our wonderful, and very loyal, work family!\"\n---\nIt says here to have all employees in attendance cheer. There's just me, and I'm not doing that. Anyways.\n---\n\"The job you have been carefully selected to fill may have been shrouded in secrecy until now, and for good reason. But now, we may lift the veil on one of the most important occupations in the Greater Confluence!\"\n---\n\"Your very, very, important job is to work as a security screener for the Agency's esteemed clients!\"\n---\n\"As you may know, the Agency transformed the travel sector overnight with the introduction of the Stream, which offers instantaneous travel between any Stream Hotspots!\"\n---\n\"This technology was made possible by the discovery of the Chronospatial Meld, also known as the C-Meld, or affectionately by many employees, as the Smeld!\"\n---\nIt says here I can tell you about the Smeld if you want. You'll learn plenty about it on the job, though. Care to hear it?\n?> Yes. -> ans1\n?> No. -> ans2\n?> Oh, do I get to talk? -> ans3","gnode_name":"rundown","id":2,"name":"rundown","position":[640,760]},{"commands_raw":"Right, so...\n---\n\"The Chronospatial Meld, also referred to as the C-Meld or Smeld, is a Class-8X interdimensional hotspot where all points everywhere in the in the history of forever intersect.\"\n---\n\"It is an incredibly enigmatic phenomena that would have likely been locked away by lesser minds if it werent for the innovations of the STV, a humble vacation travel agency.\"\n---\n\"Clients may enjoy seemingly instant travel between two Smeld 'streams' through an agonizing process that involves 'slamming' them 'headfirst' through 'all that was and ever will be'\n---\n\"Our advanced technology will then locate a \"variation\" of the client, pluck them out of the Smeld, and deposit them at their destination in one piece, and none the wiser!\"\n---\n\"Despite the infinite horrors that lurk in the Smeld, all travelers will emerge safely with 99% certainty 100% of the time!\"\n-> ans4","gnode_name":"ans1","id":3,"name":"ans1","position":[840,660]},{"commands_raw":"Yeah, wouldn't want to spout all that drivel myself. Anyways...\n-> ans4","gnode_name":"ans2","id":4,"name":"ans2","position":[840,760]},{"commands_raw":"Don't get testy with me. Want to hear this crap or not?\n?> Yes. -> ans1\n?> No. -> ans2\n?> Quiet, chatterbox. -> ans6","gnode_name":"ans3","id":5,"name":"ans3","position":[820,860]},{"commands_raw":"Alright. You're on your own, bud.","gnode_name":"ans6","id":6,"name":"ans6","position":[1060,880]},{"commands_raw":"Just a little more to get through, hold on...\n---\n\"Translocation technology is still in its infancy, and on extremely rare occasions, our clients may suffer from certain harmless complications, such as mild nausea or headaches.\"\n---\n\"It is your job to screen our clients for these common symptoms, and catalogue them accurately.\"\n---\n\"Good luck\"!\n---\nAlright, that's where their stuff ends. There's a bit more than that, though.\n---\nBasically, you'll wanna pick up the clipboard beneath the lamp to your right.\n---\nOnce you've got it, you can stow it and bring it up again with \"Q\".\n---\nYou'll see a bunch of symptoms on the clipboard. It's your job to ask the clients about their time in the Smeld, how they're feeling, and so on.\n---\nSome symptoms are a bit harder to diagnose, so we have some tools.\n---\nFor example, the sound detector can pick up normally inaudible noises, and I think there's a crystal thing that can apparently reveal invisible things...\n---\nWhatever. You've got tools. You've got to use them to figure out the symptoms.\n---\nOnce you have conducted a thorough interview, it is then your responsibility to determine whether or not the individual should be granted passage to their final destination, or first spend some time with our 'top class' clinicians to address their ailments.\n---\nBasically, they go back in the Smeld. I think forever.\n-> ans5","gnode_name":"ans4","id":7,"name":"ans4","position":[1060,720]},{"commands_raw":"Anyway, there are some common threats that make it pass the systems. Shadowhikers, chronomonons, pulsejockeys...\n---\nThey all have common symptoms. There should be a poster somewhere in there about them...\n---\nAnyways, identify threats, if you can. Failing to do that will force Disbursements to dock your pay.\n---\nRemember though, thanks to some choice lobbying, symptoms are considered benign unless they are associated with a threat, or there are 7 or more. Remember that, lucky number 7.\n---\nThe most important thing though is not to let anything...bad escape.\n---\nRight, my lunch break is nearly up. You can open the door to the interview room with the red button. A little risky, though you'll need to get in there to talk to the clients.\n---\nRemember, pick up the clipboard, fill it out, stow and unstow with \"Q\".\n---\nUse the computer to call in a client, and once you've filled out your form, submit it on the computer with \"E\".\n---\nGood luck. If something bad happens, the panic button is the big red one you saw on the way in.","gnode_name":"ans5","id":8,"name":"ans5","position":[1300,700]},{"commands_raw":"That doesn't look good.\n---\nYou'd better run.","gnode_name":"ohno","id":9,"name":"ohno","position":[640,420]}]
